tutorials/warmingPipe/pipe/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}

reactionSourceCOIW
{
    type            coded;
    active          yes;
    name	        reactionSourceCOIW;
    selectionMode   all;

    field 		        CO;

    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{        
        #include "../../constant/rnTerms/loadCommonData.H"      
        
        word currSpName("CO");
        
        #include "../../constant/rnTerms/r_powerLawV3.H"                 
    #};
}

reactionSourceO2IW
{
    type            coded;
    active          yes;
    name	        reactionSourceO2IW;
    selectionMode   all;

    field 		        O2;

    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{            
        #include "../../constant/rnTerms/loadCommonData.H"      
        
        word currSpName("O2");
        
        #include "../../constant/rnTerms/r_powerLawV3.H"                 
    #};
}

reactionSourceCO2IW
{
    type            coded;
    active          yes;
    name	        reactionSourceCO2IW;
    selectionMode   all;

    field 		        "CO2";

    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{            
        #include "../../constant/rnTerms/loadCommonData.H"         
        
        word currSpName("CO2");
        
        #include "../../constant/rnTerms/r_powerLawV3.H"                  //load reaction source
    #};
}

enthalpySourceINWALL
{
    type            coded;	
    active          yes;
    name	        enthalpySourceINWALL;
    selectionMode   all;

    field 		        "T";
    
    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{            
        #include "../../constant/rnTerms/loadCommonData.H"     
                    
        #include "../../constant/rnTerms/compEnthV2.H"                 
    #};
}