tutorials/warmingPipe/pipe/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    wall
    {
        type            patch;
        nFaces          100;
        startFace       7860;
    }
    sides
    {
        type            patch;
        nFaces          100;
        startFace       7960;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          8000;
        startFace       8060;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       16060;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       16100;
    }
)

// ************************************************************************* //
